/********************************************************************************************
* @name     os_def.h
* @author   胡益华
* @date     2024-01-09
* @brief    采用宏的方式定义了一些常用的状态判断、日志打印、错误处理
* @details  OS_isNull       OS_isNotNull
*           OS_isSuc        OS_isFail
*
*           OS_INFO         OS_WARN         OS_ERROR
*
*           OS_STATUS_SUCCESS_INFO_RE       OS_STATUS_SUCCESS_INFO_IF
*           OS_STATUS_SUCCESS_INFO_CT
*
*           OS_STATUS_FAIL_ERROR_RE         OS_STATUS_FAIL_ERROR_IF
*           OS_STATUS_FAIL_ERROR_GT         OS_STATUS_FAIL_ERROR_CT
*
*           OS_STATUS_FAIL_WARN_RE          OS_STATUS_FAIL_WARN_IF
*           OS_STATUS_FAIL_WARN_GT          OS_STATUS_FAIL_WARN_CT
********************************************************************************************/

#ifndef __OS_DEF_H__
#define __OS_DEF_H__

#include <stdio.h>
#include "os_standard.h"

/********************************************************************************************
* @brief    空指针判断
* @param    ptr: 指针变量
********************************************************************************************/
#define OS_isNull(ptr)          (((void*)(0)) == (ptr))
#define OS_isNotNull(ptr)       (((void*)(0)) != (ptr))

/********************************************************************************************
* @brief    状态判断
* @param    status: 状态变量
********************************************************************************************/
#define OS_isSuc(status)        (OS_SOK == (status))
#define OS_isFail(status)       (OS_SOK != (status))

/********************************************************************************************
* @brief    向标准输出打印信息
* @param    format: 打印信息
********************************************************************************************/
#define OS_INFO(format, ...)                                        \
    do {                                                            \
        fprintf(stdout,                                             \
        "[INFO]:  [File: %s] [Line: %d] [Function: %s()]: " format, \
        __FILE__, __LINE__, __FUNCTION__, ##__VA_ARGS__);           \
    } while(0);

/********************************************************************************************
* @brief    向标准错误打印警告
* @param    format: 打印信息
********************************************************************************************/
#define OS_WARN(format, ...)                                        \
    do {                                                            \
        fprintf(stderr,                                             \
        "[WARN]:  [File: %s] [Line: %d] [Function: %s()]: " format, \
        __FILE__, __LINE__, __FUNCTION__, ##__VA_ARGS__);           \
    } while(0);

/********************************************************************************************
* @brief    向标准错误打印错误
* @param    format: 打印信息
********************************************************************************************/
#define OS_ERROR(format, ...)                                       \
    do {                                                            \
        fprintf(stderr,                                             \
        "[ERROR]: [File: %s] [Line: %d] [Function: %s()]: " format, \
        __FILE__, __LINE__, __FUNCTION__, ##__VA_ARGS__);           \
    } while(0);

/********************************************************************************************
* @brief    判断函数返回状态，成功后打印信息到标准输出，并返回
* @param    func: 函数名称
********************************************************************************************/
#define OS_STATUS_SUCCESS_INFO_RE(func)                             \
    if (OS_isSuc(status)) {                                         \
        OS_INFO("Function "#func"() Succeed\n");                    \
        return status;                                              \
    }

/********************************************************************************************
* @brief    判断函数返回状态，成功后仅打印信息到标准输出，不返回
* @param    func: 函数名称
********************************************************************************************/
#define OS_STATUS_SUCCESS_INFO_IF(func)                             \
    if (OS_isSuc(status)) {                                         \
        OS_INFO("Function "#func"() Succeed\n");                    \
    }

/********************************************************************************************
* @brief    判断函数返回状态，成功后仅打印信息到标准输出，并二次循环
* @param    func: 函数名称
********************************************************************************************/
#define OS_STATUS_SUCCESS_INFO_CT(func)                             \
    if (OS_isSuc(status)) {                                         \
        OS_INFO("Function "#func"() Succeed\n");                    \
        continue;                                                   \
    }

/********************************************************************************************
* @brief    判断函数返回状态，失败后仅打印错误信息到标准错误，并返回
* @param    func: 函数名称
********************************************************************************************/
#define OS_STATUS_FAIL_ERROR_RE(func)                               \
    if (OS_isFail(status)) {                                        \
        OS_ERROR("Function "#func"() Fail: [%d]\n", status);        \
        return status;                                              \
    }

/********************************************************************************************
* @brief    判断函数返回状态，失败后仅打印错误信息到标准错误，不返回
* @param    func: 函数名称
********************************************************************************************/
#define OS_STATUS_FAIL_ERROR_IF(func)                               \
    if (OS_isFail(status)) {                                        \
        OS_ERROR("Function "#func"() Fail: [%d]\n", status);        \
    }

/********************************************************************************************
* @brief    判断函数返回状态，失败后仅打印错误信息到标准错误，并跳转
* @param    func: 函数名称
********************************************************************************************/
#define OS_STATUS_FAIL_ERROR_GT(func, label)                        \
    if (OS_isFail(status)) {                                        \
        OS_ERROR("Function "#func"() Fail: [%d]\n", status);        \
        goto label;                                                 \
    }

/********************************************************************************************
* @brief    判断函数返回状态，失败后仅打印错误信息到标准错误，并二次循环
* @param    func: 函数名称
********************************************************************************************/
#define OS_STATUS_FAIL_ERROR_CT(func)                               \
    if (OS_isFail(status)) {                                        \
        OS_ERROR("Function "#func"() Fail: [%d]\n", status);        \
        continue;                                                   \
    }

/********************************************************************************************
* @brief    判断函数返回状态，失败后仅打印警告信息到标准错误，并返回
* @param    func: 函数名称
********************************************************************************************/
#define OS_STATUS_FAIL_WARN_RE(func)                                \
    if (OS_isFail(status)) {                                        \
        OS_WARN("Function "#func"() Fail: [%d]\n", status);         \
        return status;                                              \
    }

/********************************************************************************************
* @brief    判断函数返回状态，失败后仅打印警告信息到标准错误，不返回
* @param    func: 函数名称
********************************************************************************************/
#define OS_STATUS_FAIL_WARN_IF(func)                                \
    if (OS_isFail(status)) {                                        \
        OS_WARN("Function "#func"() Fail: [%d]\n", status);         \
    }

/********************************************************************************************
* @brief    判断函数返回状态，失败后仅打印警告信息到标准错误，并跳转
* @param    func: 函数名称
********************************************************************************************/
#define OS_STATUS_FAIL_WARN_GT(func, label)                         \
    if (OS_isFail(status)) {                                        \
        OS_WARN("Function "#func"() Fail: [%d]\n", status);         \
        goto label;                                                 \
    }

/********************************************************************************************
* @brief    判断函数返回状态，失败后仅打印警告信息到标准错误，并二次循环
* @param    func: 函数名称
********************************************************************************************/
#define OS_STATUS_FAIL_WARN_CT(func)                                \
    if (OS_isFail(status)) {                                        \
        OS_WARN("Function "#func"() Fail: [%d]\n", status);         \
        continue;                                                   \
    }

#endif
