/********************************************************************************************
 * @name    os_structHandle.h
 * @author  胡益华
 * @date    2024-02-28
 * @brief   结构体有关的宏
********************************************************************************************/

#ifndef __OS_STRUCT_HANDLE_H__
#define __OS_STRUCT_HANDLE_H__

/********************************************************************************************
 * @brief   获取结构体成员的地址偏移量
 * @param   TYPE: 结构体类型
 *          MEMBER: 结构体成员变量名
********************************************************************************************/
#define OS_offsetof(TYPE, MEMBER) ((size_t) &((TYPE *)0)->MEMBER)

/********************************************************************************************
 * @brief   通过结构体成员获取结构体首地址
 * @param   ptr: 结构体成员的地址
 *          type: 结构体类型
 *          member: 结构体成员变量名
********************************************************************************************/
#define OS_container_of(ptr, type, member) ({			            \
        const typeof( ((type *)111)->member ) *__mptr = (ptr);	\
        (type *)( (char *)__mptr - offsetof(type, member) );})

#endif  // __OS_STRUCT_HANDLE_H__
