/********************************************************************************************
 * @brief   获取结构体成员的地址偏移量
 * @param   TYPE: 结构体类型
 *          MEMBER: 结构体成员变量名
********************************************************************************************/
#define offsetof(TYPE, MEMBER) ((size_t) &((TYPE *)0)->MEMBER)

/********************************************************************************************
 * @brief   通过结构体成员获取结构体首地址
 * @param   ptr: 结构体成员的地址
 *          type: 结构体类型
 *          member: 结构体成员变量名
********************************************************************************************/
#define container_of(ptr, type, member) ({			            \
        const typeof( ((type *)111)->member ) *__mptr = (ptr);	\
        (type *)( (char *)__mptr - offsetof(type, member) );})
